#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

#include <windows.h>

int Choic()
{
	int i = 0;
	printf("¾õµÃÎÒË§µÄ¿Û1£¬ÍË³öÖ±½Ó¿Û2:");
	scanf("%d", &i);
	return i;
}
void print_love()
{
	printf("×îºó×£·ÒµÏÉúÈÕ¿ìÀÖ~\n");
	Sleep(1000);
		float x, y, a;
		for (y = 1.5; y > -1.5; y -= 0.1)
		{
			for (x = -1.5; x < 1.5; x += 0.05)
			{
				a = x * x + y * y - 1;
				putchar(a * a * a - x * x * y * y * y <= 0.0 ? '*' : ' ');
			}
			system("color 0c");
			putchar('\n');
		}

}
void putfileinto() {

	FILE* pr = fopen("D:\\ÉúÈÕ¿ìÀÖÎÄ¼þ¼Ð\\ÌìÊ¹×£¸£\\Happy birthday.txt", "w");
	FILE* ps = fopen("D:\\ÉúÈÕ¿ìÀÖÎÄ¼þ¼Ð\\birthday 9.9\\birthday 9.9\\happy birthday_copy.txt", "r");
	int change = 0;
	if (NULL == pr || NULL == ps)
	{
		ferror("fopen");
	}
	while ((change = fgetc(ps))!= EOF)
	{
		fputc(change, pr);
	}
	//¹Ø±ÕÎÄ¼þ
	fclose(pr);
	pr = NULL;
	fclose(ps);
	ps = NULL;
}
int main(void)
{
	
	printf("ÍíÉÏºÃ£¬ÎÒµÄºÃ·ÒµÏ\n");
	Sleep(2000);
	printf("ÖªµÀÒªÉúÈÕÁË£¬ÌØµØÀ´¸øÄãËÍ×£¸£\n");
	Sleep(2000);
	printf("²»¹ýÔÚÕâÖ®Ç°£¬ÄãÒªÏÈ»Ø´ð£ºÎÒË§²»Ë§\n");
	Sleep(1000);
	printf("×¢Òâ²»ÒªÂÒÊäÈë£¬²»È»µçÄÔ»á±¬Õ¨£¡\n");
	Sleep(2000);
	int i = Choic();
	int c2 = 0;
	switch (i)
	{
	case 1:
		Sleep(1000);
		printf("ÎÒ¾ÍÖªµÀÄã¾õµÃÎÒÊÇÊÀ½çµÚÒ»Ë§\n");
		break;
	case 2:
		Sleep(1000);
		printf("ÕýÔÚÍË³öÖÐ>>>\n");
		Sleep(3000);
		printf("ÊÇ²»ÊÇºó»ÚÁË£¿\n");
		Sleep(1000);
		printf("1.ºó»ÚËÀÀ²  2.¾ø²»ºó»Ú\n");//×¢ÒâÕâÀïÊÇ·ñÒª¼Ó\n
		printf("Ñ¡°É~  ->");//×¢ÒâÕâÀïÊÇ·ñÒª¼Ó\n
		scanf("%d",&c2);
		switch (c2)
		{
		case 1:
			Sleep(1000);
			printf("ÎÒ¾ÍÖªµÀÄã¾õµÃÎÒÊÇÊÀ½çµÚÒ»Ë§\n");
			break;
		case 2:
			Sleep(1000);
			printf("ºÇºÇ£¬´òµÄ²»´íÅ¶\n");
			break;
		default:
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");//¹Û²ì±¬Õ¨µÄ¹æÄ£ÊÇ·ñ×ã¹»
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
			Sleep(3000);
			break;

		}
		break;
	default:
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		printf("±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨±¬Õ¨\n");
		Sleep(3000);
		break;
	}
	if (1 == i|| 1 == c2)
	{
		Sleep(1000);
		printf("ºÃÁË£¬ÄãÒÑ¾­Í¨¹ýÁËÊÔÁ¶£¬¿ÉÒÔµÃµ½ÌìÊ¹µÄ×£¸£ÁË\n");
		printf("Ê²Ã´£¬ÄãËµÄãÃ»ÓÐ¿´¼û£¿\n");
		Sleep(1000);
		printf("È¥ÌìÊ¹ÎÄ¼þ¼ÐÀïÃæÕÒÕÒ°É\n");
		putfileinto();
		Sleep(3000);
		print_love();
		Sleep(1000);
		printf("´ËÎÄ¼þ²»»á×Ô¶¯¹Ø±Õ£¬ÇëÊÖ¶¯¹Ø±Õ\n");
		Sleep(90000000000000000);
		//¿ªÆôÎÄ¼þ
	}
	return 0;
}